In [1]:
import numpy as np
import pandas as pd

Step 2. Create 3 differents Series, each of length 100, as follows:
The first a random number from 1 to 4
The second a random number from 1 to 3
The third a random number from 10,000 to 30,000

In [2]:
s1=pd.Series(np.random.randint(1,5,100))
s2=pd.Series(np.random.randint(1,4,100))
s3=pd.Series(np.random.randint(10000,30000,100))
type(s3)

pandas.core.series.Series

Step 3. Let's create a DataFrame by joinning the Series by column

In [4]:
set1=pd.concat([s1,s2,s3],axis=1)
set1
type(set1)

pandas.core.frame.DataFrame

Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [27]:
set1.rename(columns={0:'bedrs',1:'bathrs',2:'price_sqr_meter'})

    bedrs  bathrs  price_sqr_meter
0       4       2            24776
1       4       3            24616
2       3       3            18956
3       3       2            29356
4       2       2            18480
..    ...     ...              ...
95      3       2            20794
96      3       2            29732
97      2       2            24486
98      1       2            18688
99      1       2            15027

[100 rows x 3 columns]

Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [12]:
bigcolumn=pd.concat([s1,s2,s3],axis=0)
type(bigcolumn)
bigcolumn.to_frame

<bound method Series.to_frame of 0         1
1         3
2         1
3         2
4         1
      ...
95    21195
96    18904
97    16730
98    18286
99    20400
Length: 300, dtype: int32>

Step 6. Ops it seems it is going only until index 99. Is it true?¶

In [13]:
bigcolumn.shape

(300,)

Step 7. Reindex the DataFrame so it goes from 0 to 299¶

In [16]:
bg=bigcolumn.reset_index(drop=True)
bg

0          1
1          3
2          1
3          2
4          1
       ...
295    21195
296    18904
297    16730
298    18286
299    20400
Length: 300, dtype: int32